<center><h1>Group By</h1></center> <br>
Groupby- We can use some criteria in different-2 ways to split data. <br>
Syntax - df.groupby() <br>

When we apply groupby fn on df 3 operations performs : <br>
Splitting the object - <br>
Applying a fn - <br>
Combining the result - <br>

In [1]:
import pandas as pd

In [2]:
f = pd.read_csv('E:\Coding Tutorials\Jupyter Tutorial\Machine Learning Tutorials\Tutorialcsvdata\Tut34 .csv')
f

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

# Splliting the object

In [3]:
grp1 = f.groupby(by='Section')                                         # when we call groupby fn in df, we get groupby object 
grp1

In [4]:
grp1.groups                                                              # It will create groups according to Section label(Col)

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

In [5]:
# Make groups by list of labels(Multiple columns
grp2=f.groupby(by = ['Section' , 'Class'])                                        # Method 1
grp2

In [6]:
grp2.groups

{('A', 10): [0, 2], ('B', 10): [1], ('C', 11): [3], ('C', 12): [4]}

In [7]:
grp2 =f.groupby(['Section' , 'Class']).groups                                      # Method 2   
grp2

{('A', 10): [0, 2], ('B', 10): [1], ('C', 11): [3], ('C', 12): [4]}

In [8]:
for sec , clas in grp2:
    print(sec)
    print(clas)

A
10
B
10
C
11
C
12

In [9]:
grp3 = f.groupby('Class').get_group(10)                           # Split data in form of class
grp3

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [10]:
grp4 = f.groupby('Section').get_group('A')                     # Split data in form of Section
grp4

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

# Applying a function

In [11]:
grp4

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

In [12]:
grp4.sum()                                                     # grp4 sum

Student_ID                2004
Section                     AA
Class                       20
Study_hrs                    5
Social Media usage hrs       5
Percentage                 110
dtype: object

In [13]:
grp3

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [14]:
grp3.sum()

Student_ID                3006
Section                    ABA
Class                       30
Study_hrs                   11
Social Media usage hrs       7
Percentage                 190
dtype: object

In [15]:
grp3.mean()

Student_ID                1002.000000
Class                       10.000000
Study_hrs                    3.666667
Social Media usage hrs       2.333333
Percentage                  63.333333
dtype: float64

In [16]:
grp3.describe()

       Student_ID  Class  Study_hrs  Social Media usage hrs  Percentage
count         3.0    3.0   3.000000                3.000000    3.000000
mean       1002.0   10.0   3.666667                2.333333   63.333333
std           1.0    0.0   2.081666                0.577350   15.275252
min        1001.0   10.0   2.000000                2.000000   50.000000
25%        1001.5   10.0   2.500000                2.000000   55.000000
50%        1002.0   10.0   3.000000                2.000000   60.000000
75%        1002.5   10.0   4.500000                2.500000   70.000000
max        1003.0   10.0   6.000000                3.000000   80.000000

# Applying Multiple functions Using Aggregate

In [17]:
grp3

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [18]:
grp3.agg(['sum' , 'max' , 'min' , 'mean'])

      Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
sum       3006.0     ABA   30.0  11.000000                7.000000  190.000000
max       1003.0       B   10.0   6.000000                3.000000   80.000000
min       1001.0       A   10.0   2.000000                2.000000   50.000000
mean      1002.0     NaN   10.0   3.666667                2.333333   63.333333

In [20]:
grp4=f.groupby('Section').get_group('C')

In [21]:
grp4

   Student_ID Section  Class  Study_hrs  Social Media usage hrs  Percentage
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75